ErpTest/src/InformationRegisters/ДанныеОснованийСчетовФактур/ДанныеОснованийСчетовФактур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеОснованийСчетовФактур</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СуммаБезНДС</name>
    <comment>Сумма без НДС в валюте документа</comment>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <comment>Сумма НДС в валюте документа</comment>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>СуммаБезНДСРегл</name>
    <comment>Сумма без НДС в валюте регламентированного учета</comment>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>БазаНДСРегл</name>
    <comment>Налоговая база</comment>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДСРегл</name>
    <comment>Сумма НДС в валюте регламентированного учета</comment>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <comment>Дата документа</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <comment>Валюта документа</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация документа</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение, от имени которого оформляется документ</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Контрагент документа</comment>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <comment>Договор контрагентом</comment>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВозврат</name>
    <comment>Признак того, что документ отражает операцию возврата</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлениеОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректировкаПоСогласованиюСторон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипСчетаФактуры</name>
    <comment>Тип счета-фактуры, который формируются на основании документа</comment>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦенности</name>
    <type>
      <types>EnumRef.ВидыЦенностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗапасов</name>
    <type>
      <types>EnumRef.ТипыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодТНВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УменьшениеСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСчетаФактурыКомиссионера</name>
    <comment>Дата счета-фактуры, выставленного комиссионером (принципалом) покупателю и отраженная в Отчете комиссионера (принципала)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСчетаФактурыКомиссионера</name>
    <comment>Номер счета-фактуры, выставленного комиссионером покупателю</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетФактураВыданныйКомиссионером</name>
    <comment>Счет-фактура выданный покупателю комиссионного товара (агентских услуг)</comment>
    <type>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.СчетФактураКомиссионеру</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПокупательКомиссионногоТовара</name>
    <comment>Покупатель комиссионных товаров (агентских услуг) указанный в Отчете комиссионера (агента)</comment>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорректируемыйДокумент</name>
    <comment>Заполняется в случае исправления ошибок или корректировки по согласованию сторон</comment>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/ДанныеОснованийСчетовФактур/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти
	
#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры = Неопределено) Экспорт
	
	ПолноеИмяРегистра = "РегистрСведений.ДанныеОснованийСчетовФактур";
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	
	ТипыДокументов = ТипыДокументовКОбработке();
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Для Каждого ТипДокумента Из ТипыДокументов Цикл
		
		Если ТипДокумента = "ВозвратТоваровОтКлиента"
		 Или ТипДокумента = "ВозвратТоваровПоставщику" Тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДанныеДокумента.Ссылка КАК Регистратор
			|ИЗ
			|	Документ.ВозвратТоваровОтКлиента КАК ДанныеДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОснованийСчетовФактур КАК ДанныеОснованийСчетовФактур
			|		ПО ДанныеДокумента.Ссылка = ДанныеОснованийСчетовФактур.Регистратор
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеОснованийСчетовФактур.Регистратор ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДанныеОснованийСчетовФактур.Регистратор КАК Регистратор
			|ИЗ
			|	РегистрСведений.ДанныеОснованийСчетовФактур КАК ДанныеОснованийСчетовФактур
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК ДанныеДокумента
			|		ПО ДанныеДокумента.Ссылка = ДанныеОснованийСчетовФактур.Регистратор
			|ГДЕ
			|	НЕ ДанныеОснованийСчетовФактур.УменьшениеСуммы";
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВозвратТоваровОтКлиента", ТипДокумента);
		ИначеЕсли ТипДокумента = "КорректировкаПриобретения"
		 Или ТипДокумента = "КорректировкаРеализации" Тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДанныеДокумента.Ссылка КАК Регистратор
			|ИЗ
			|	Документ.КорректировкаПриобретения КАК ДанныеДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОснованийСчетовФактур КАК ДанныеОснованийСчетовФактур
			|		ПО ДанныеДокумента.Ссылка = ДанныеОснованийСчетовФактур.Регистратор
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеОснованийСчетовФактур.Регистратор ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДанныеОснованийСчетовФактур.Регистратор КАК Регистратор
			|ИЗ
			|	РегистрСведений.ДанныеОснованийСчетовФактур КАК ДанныеОснованийСчетовФактур
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК ДанныеДокумента
			|		ПО ДанныеДокумента.Ссылка = ДанныеОснованийСчетовФактур.Регистратор
			|ГДЕ
			|	ДанныеОснованийСчетовФактур.КорректируемыйДокумент = НЕОПРЕДЕЛЕНО";
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КорректировкаПриобретения", ТипДокумента);
		Иначе
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ДанныеДокумента.Ссылка КАК Регистратор
			|ИЗ
			|	Документ.ПриобретениеТоваровУслуг КАК ДанныеДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеОснованийСчетовФактур КАК ДанныеОснованийСчетовФактур
			|		ПО ДанныеДокумента.Ссылка = ДанныеОснованийСчетовФактур.Регистратор
			|ГДЕ
			|	ДанныеДокумента.Проведен
			|	И ДанныеОснованийСчетовФактур.Регистратор ЕСТЬ NULL";
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПриобретениеТоваровУслуг", ТипДокумента);
		КонецЕсли;
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
		
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(
			Параметры, 
			Регистраторы,
			ДополнительныеПараметры);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Регистраторы = Новый Массив;
	Для Каждого ИмяДокумента Из ТипыДокументовКОбработке() Цикл
		Регистраторы.Добавить("Документ." + ИмяДокумента);
	КонецЦикла;
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазыУТ.ДополнительныеПараметрыПерезаписиДвиженийИзОчереди();
	ДополнительныеПараметры.ОбновляемыеДанные = Параметры.ОбновляемыеДанные;
		
	ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(
		Регистраторы,
		"РегистрСведений.ДанныеОснованийСчетовФактур",
		Параметры.Очередь,
		ДополнительныеПараметры);
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

Функция ТипыДокументовКОбработке()
	
	ТипыДокументовКОтражению = Новый Массив;
	ТипыДокументовКОтражению.Добавить("АктВыполненныхРабот");
	ТипыДокументовКОтражению.Добавить("ВводОстатков");
	ТипыДокументовКОтражению.Добавить("ВозвратТоваровМеждуОрганизациями");
	ТипыДокументовКОтражению.Добавить("ВозвратТоваровОтКлиента");
	ТипыДокументовКОтражению.Добавить("ВозвратТоваровПоставщику");
	ТипыДокументовКОтражению.Добавить("ВыкупВозвратнойТарыКлиентом");
	ТипыДокументовКОтражению.Добавить("ВыкупВозвратнойТарыУПоставщика");
	ТипыДокументовКОтражению.Добавить("ЗаписьКнигиПродаж");
	ТипыДокументовКОтражению.Добавить("КорректировкаПриобретения");
	ТипыДокументовКОтражению.Добавить("КорректировкаРеализации");
	ТипыДокументовКОтражению.Добавить("ОтчетКомиссионера");
	ТипыДокументовКОтражению.Добавить("ОтчетКомитенту");
	ТипыДокументовКОтражению.Добавить("ОтчетПоКомиссииМеждуОрганизациями");
	ТипыДокументовКОтражению.Добавить("ПередачаТоваровМеждуОрганизациями");
	ТипыДокументовКОтражению.Добавить("ПриобретениеТоваровУслуг");
	ТипыДокументовКОтражению.Добавить("ПриобретениеУслугПрочихАктивов");
	ТипыДокументовКОтражению.Добавить("РеализацияТоваровУслуг");
	ТипыДокументовКОтражению.Добавить("РеализацияУслугПрочихАктивов");
	//++ НЕ УТ
	ТипыДокументовКОтражению.Добавить("ВыкупПринятыхНаХранениеТоваров");
	ТипыДокументовКОтражению.Добавить("ОтчетПереработчика");
	ТипыДокументовКОтражению.Добавить("ПриобретениеУслугПоЛизингу");
	//-- НЕ УТ
	//++ НЕ УТКА
	ТипыДокументовКОтражению.Добавить("ОтчетДавальцу");
	//-- НЕ УТКА
	Возврат ТипыДокументовКОтражению;
	
КонецФункции

#КонецОбласти

#КонецЕсли
